actuator/actuatorSvarnas/flow_cht/flow_laminar/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kD                  kD [1 2 -3 -1 0 0 0] 2.9;

kI                  kI [1 2 -3 -1 0 0 0] 3.6;

kA                  k0 [1 2 -3 -1 0 0 0] 1.0;

// ************************************************************************* //
