actuator/actuatorSvarnas/flow_cht/flow_laminar/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    HVelectrodeBaffle
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    HVelectrodeZone;

        patches
        {
            master
            {
                name        highVoltage;
                type        wall;
            }
            slave
            {
                $master;
            }
        }
    }

    GRelectrodeBaffle
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    GRelectrodeZone;

        patches
        {
            master
            {
                name        ground;
                type        wall;
            }
            slave
            {
                $master;
            }
        }
    }
}


// ************************************************************************* //
